{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Mackerel and Mustard Tart",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "recipeIngredient": [
    "For the pastry",
    "125 g butter, cubed, plus extra for greasing",
    "250 g plain flour, plus extra for dusting",
    "a pinch of salt",
    "1 egg yolk",
    "50ml cold water",
    "For the filling",
    "3 smoked mackerel fillet",
    "3 whole eggs",
    "6 egg yolks",
    "250 ml double cream",
    "1-2 tsp coarse wholegrain mustard",
    "1 bunch watercress, chopped",
    "1 handful grated extra mature cheddar, or other sharp-tasting cheese",
    "To serve",
    "dressed salad leaves, to serve"
  ],
  "recipeInstructions": [
    "1. For the pastry: put the butter, flour and a pinch of salt in a food processor and blend until the mixture resembles fine breadcrumbs. Mix the egg yolk with 50ml cold water, add to the mixer and continue processing until a dough is formed. Wrap it in cling film and chill for at least 1 hour, removing it from the refrigerator 15 minutes before you want to roll it.",
    "2. Preheat the oven to 170C.",
    "3. Butter a 25cm spring-form tart tin and sprinkle with a little flour. Lightly dust the dough with flour and roll out to a thickness of 3mm. Carefully lift the dough and lay it over the tart tin, then gently press down into the base. Trim the edges, leaving a rim of pastry above the rim of the tin to allow for shrinkage. Prick the base with a fork, then chill for 30 minutes. Line the pastry with a sheet of greaseproof paper, then fill with dried peas or beans and bake for 12 minutes.",
    "4. Preheat the oven to 180C.",
    "For the filling: skin the mackerel fillets, cut them in half lengthways and flake the flesh, removing any bones. Beat together the whole eggs, egg yolks, cream, mustard and some salt and pepper. Scatter the mackerel and watercress over the base of the part-cooked tart shell. Place the pastry case in the oven. Carefully pour in the egg mixture, stopping when the liquid reaches the rim of the case – be careful not to let it overflow. Top with grated cheese then bake for 30-40 minutes, until the filling has set. Remove the tart from the oven. Trim off any excess pastry around the rim then cut into wedges and serve with dressed salad leaves."
  ],
  "recipeCategory": null,
  "recipeCuisine": "British",
  "keywords": [
    "Seafood",
    "Mackerel"
  ],
  "tool": []
}