{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Arroz Con Pollo",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "recipeYield": "6 servings",
  "prepTime": "PT20M",
  "cookTime": "PT20M",
  "recipeIngredient": [
    "150 g white rice",
    "1 whole chicken (chopped into serving slices)",
    "300 g green peas",
    "180 g sliced green olives",
    "110 g sliced pimiento",
    "2 chopped onions",
    "1 chopped tomato",
    "1 minced clove of garlic",
    "1 bay leaf",
    "2 tbsps olive oil",
    "1/4 tsp saffron",
    "1/2 tsp crushed red pepper",
    "paprika",
    "salt and pepper",
    "625 ml water",
    "400 ml chicken broth"
  ],
  "recipeInstructions": [
    "1. Mix rice and 375 ml of water in a metal bowl. Make sure it can loosely fit in your pressure cooker.",
    "2. Place your steamer basket and the bowl in the pressure cooker.",
    "3. Add the rest of the water to the cooker.",
    "4. Securely close the cooker with the pressure regulator on the vent pipe.",
    "5. Cook at 15 PSI for 5 minutes. The pressure regulator should rock slowly during this time.",
    "6. After cooking time is done, let the pressure drop on its own. Then remove the bowl of rice, water and steamer basket from the cooker.",
    "7. Meanwhile, season the chicken with paprika, salt and pepper.",
    "8. Heat oil in the pressure cooker and cook a few pieces of the chicken at a time until browned. Set chicken aside.",
    "9. Next, saute garlic and onions until softened.",
    "10. Place the chicken back to the pressure cooker, together with the red pepper, saffron, bay leaf and broth.",
    "11. Close the pressure cooker with the pressure regulator on the vent pipe.",
    "12. Cook at 15 PSI for 8 minutes. The pressure regulator should rock slowly during this time.",
    "13. Remove the chicken and stir in with the rice. Add in green peas, tomato, olives, and pimiento."
  ],
  "recipeCategory": null,
  "recipeCuisine": "Pressure Cooker",
  "keywords": [],
  "tool": []
}