{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Home Cured Corned Beef",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "prepTime": "PT5D",
  "cookTime": "PT3H",
  "recipeIngredient": [
    "Pickling spices",
    "1 Tbsp whole allspice berries",
    "1 Tbsp whole mustard seeds (brown or yellow)",
    "1 Tbsp coriander seeds",
    "1 Tbsp red pepper flakes",
    "1 Tbsp whole cloves",
    "1 Tbsp whole black peppercorns",
    "9 whole cardamom pods",
    "6 large bay leaves, crumbled",
    "2 teaspoons ground ginger",
    "1/2 stick cinnamon",
    "Brine",
    "1 gallon water",
    "2 cups Kosher salt",
    "5 teaspoons pink curing salt*",
    "3 Tbsp pickling spices",
    "1/2 cup brown sugar",
    "Brisket",
    "1 4-5 pound beef brisket",
    "1 Tbsp pickling spices"
  ],
  "recipeInstructions": [
    "1 You can either used store-bought pickling spices or you can make your own. To make your own, toast the allspice berries, mustard seeds, coriander seeds, red pepper flakes, cloves, peppercorns, and cardamom pods in a small frying pan on high heat until fragrant and you hear the mustard seeds start to pop. Remove from heat and place in a small bowl. Use a mortar and pestle to crush the spices a little (or the back of a spoon or the side of a knife on a flat surface). Add to a small bowl and stir in the crumbled bay leaves and ground ginger.",
    "2 Add about 3 Tbsp of the spice mix (reserve the rest for cooking the corned beef after it has cured), plus the half stick of cinnamon, to a gallon of water in a large pot, along with the Kosher salt, pink salt (if using), and brown sugar. Bring to a boil, then remove from heat and let cool to room temperature. Then refrigerate until well chilled.",
    "3 Place the brisket in a large, flat container or pan, and cover with the brine. The brine should cover the meat. The meat may float in which case you may want to weigh it down with a plate. Alternatively you can use a 2-gallon freezer bag (placed in a container so if it leaks it doesn't leak all over your refrigerator), place the brisket in the freezer bag and about 2 quarts of brine, squeezing out the air from the bag before sealing. Place in the refrigerator and chill from 5-7 days. Every day flip the brisket over, so that all sides get brined equally.",
    "4 At the end of the cure, remove the brisket from the brine and rinse off the brine with cold water. Place the brisket in a large pot that just fits around the brisket and cover with at least one inch of water. If you want your brisket less salty, add another inch of water to the pot. Add a tablespoon of the pickling spices to the pot. Bring to a boil, reduce to a very low simmer (barely bubbling), and cook 3-4 hours, until the corned beef is fork tender. (At this point you can store in the fridge for up to a week.) Remove the meat to a cutting board. (You can use the spiced cooking liquid to cook vegetables for boiled dinner or corned beef and cabbage.) Slice thinly against the grain to serve."
  ],
  "recipeCategory": null,
  "recipeCuisine": "Pressure Cooker",
  "keywords": [],
  "tool": []
}