{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Richard Ehrlich's Duck Casserole",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "recipeYield": "Serves 4",
  "recipeIngredient": [
    "medium duck 1.75–2.25kg",
    "vegetable oil 2-3 tbsp",
    "plain flour 2 tbsp",
    "Cognac 3 tbsp",
    "dry white wine 100ml",
    "chicken or duck stock 250ml",
    "bouquet garni or mixed herbs such as herbes de Provence",
    "tomato purée 1 tsp",
    "carrot 1",
    "small white onions 12",
    "small button mushrooms 12"
  ],
  "recipeInstructions": [
    "1. Joint the duck, or have the butcher do it for you. Pour enough oil into the pressure cooker to coat the base. Season the duck with salt and ground black pepper and turn the heat to medium high. Brown a few pieces then remove to a plate. Pour out the excess oil, leaving in about 2 tbsp.",
    "2. Return the pressure cooker to the heat and stir in the flour. When it is mixed into the fat, add the Cognac, wine, stock, herbs and tomato purée. Bring to the boil and put in the duck pieces and the carrot. Clamp on the lid. Bring to full pressure, turn the heat down to medium and cook for 20 minutes. Turn off the heat and vent immediately.",
    "3. While the duck is cooking, put the onions into a pan with water or stock to cover. Simmer for 15 minutes then drain. Put the onions and mushrooms into the pressure cooker, turn the heat down to medium and cook for 5 minutes more. Remove all the solid ingredients from the pressure cooker, setting the carrot aside. Put the carrot in a fine sieve and mash it back into the pressure cooker. Stir into the cooking liquid to blend. Taste the liquid. If it is too diluted, boil it down briskly. If there isn't enough of it, add stock or water. Serve with chopped parsley, rice or mashed potatoes.",
    "4. To cook the duck without a pressure cooker, make in the traditional way in a large, heavy-based casserole. The cooking of the duck will take 50-60 minutes or when the meat comes easily away from the bones. You can skip cooking the onions separately, adding them to the pan at the same time as the duck pieces."
  ],
  "recipeCategory": null,
  "recipeCuisine": "Pressure Cooker",
  "keywords": [],
  "tool": []
}