{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Lobster Ravioli with Crabmeat Cream Sauce",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "recipeYield": "4",
  "prepTime": "PT30M",
  "cookTime": "PT35M",
  "recipeIngredient": [
    "For the ravioli",
    "2 ounces unsalted butter",
    "1 clove garlic, chopped",
    "1 tablespoon chopped shallots",
    "16 ounces cooked lobster meat",
    "4 ounces cooked snow crabmeat",
    "2 ounces Cognac",
    "2 ounces ricotta",
    "Salt",
    "Pepper",
    "1 tablespoon chopped chives",
    "Pasta dough, recipe follows",
    "Egg white, slightly beaten",
    "For the sauce",
    "2 ounces unsalted butter",
    "1 tablespoon chopped shallots",
    "4 ounces whole chunk Maryland crabmeat",
    "2 ounces Cognac",
    "5 ounces tomato sauce",
    "10 ounces heavy cream",
    "Salt"
  ],
  "recipeInstructions": [
    "1. For the Lobster Ravioli: In a large saute pan, add the butter and melt. Add the garlic and shallots and saute until golden brown. Add lobster, crab, and chives and saute 2 to 3 minutes. Add Cognac and reduce for 2 minutes. Remove from heat and cool for 30 minutes, until room temperature. Chop lobster mixture into small chunks. In a large bowl, combine lobster mixture and ricotta and mix well. Season with salt and pepper.",
    "2. Lay out the first piece of pasta dough on the table and place 1/4-ounce mounds of stuffing 2 inches apart. Using a pastry brush, brush egg white around each bit of stuffing, making the dough damp not wet. Take the second piece and cover the bottom piece with the stuffing. Press around each ravioli being careful not to squeeze the stuffing out. Using a round ravioli cutter, cut each ravioli round and put on a sheet pan sprinkled with semolina. Gently place ravioli in boiling water and cook for 8 to 10 minutes, or until al dente.",
    "3. For the sauce: Using a 12-inch saute pan at medium heat, add butter, shallots, and saute until shallots are translucent. Add the crabmeat and saute for about 2 to 3 minutes. Remove the saute pan from the burner and add Cognac then place pan back on the heat to cook off the alcohol. (Please beware: the Cognac will create a large flame.) Once the flame stops, add the tomato sauce and cream with salt and cook until it reduces half way and becomes creamy. Add the cooked ravioli to the sauce and let cook together for about 1 minute before serving. Garnish with chives"
  ],
  "recipeCategory": null,
  "recipeCuisine": "Italian",
  "keywords": [
    "Pasta",
    "Ravioli Fillings",
    "Seafood"
  ],
  "tool": []
}