{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Pineapple Fried Rice - Kao Pad Sapparod",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "recipeYield": "2",
  "recipeIngredient": [
    "8 Shrimp (leave 4 whole, and cut the rest into small pieces)",
    "1 egg",
    "250 grams of cooked rice, about 1.5 cups",
    " 1/4 cup small diced onions",
    "1 tbsp Thai soy sauce",
    "1 tsp fish sauce",
    "1 tsp sugar",
    "1/8 tsp salt",
    "1 tsp curry powder",
    " 1/4 tsp White pepper",
    "1 tsp prepared shrimp tomalley, a.k.a. shrimp paste (optional)",
    " 1/2 cup Pineapple, fresh if you can, cut into small pieces",
    " 1/3 cup roasted or fried cashews, unsalted",
    "2 green onions, chopped",
    " 1/2 cup tomatoes, seeds removed, cut into half inch cubes",
    "Cucumber slices for serving "
  ],
  "recipeInstructions": [
    "1. In a wok or a large frying pan, heat 2 Tbsp of vegetable oil until hot. Sear the whole shrimp until done; remove and set aside. In the same pan, add the small pieces of shrimp and cook until done; remove and set aside.",
    "2. Add more oil to the wok if needed, then add the egg and scramble slightly. When the egg is half way cooked, add the rice and toss to mix. Add the diced onions and toss to mix. Add curry powder, white pepper, sugar, salt, soy sauce, fish sauce, and shrimp paste (if using); toss until the rice grains are separated and the seasoning is well mixed. Add the pineapple, cashews, and small pieces of shrimp; toss until the pineapples start to darken slightly and the rice is dry. Turn off the heat and toss in tomatoes and green onions.",
    "3. Serve on a plate or in a pineapple bowl with some cucumber slices. Top with the whole shrimp and extra green onions."
  ],
  "recipeCategory": null,
  "recipeCuisine": "Thai",
  "keywords": [
    "Rice"
  ],
  "tool": []
}