{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Smoked Ham & Haddie Tart",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "recipeIngredient": [
    "225g smoked haddock fillet,",
    "150ml milk mixed with 100ml water,",
    "2 sprigs of flat leaf parsley including the stalk,",
    "1 bay leaf,",
    "Finely grated rind of 1 large lemon,",
    "Freshly ground black pepper,",
    "Freshly grated nutmeg,",
    "1 small onion (finely chopped),",
    "25g butter,",
    "1 level tbsp plain flour,",
    "3 large fresh eggs,",
    "125ml double cream,",
    "1 rounded tbsp finely chopped flat parsley,",
    "2 spring onions (chopped small, including the best of the green tops),",
    "100g sliced smoked ham (roughly chopped),",
    "50g finely grated mature white Scottish cheddar cheese."
  ],
  "recipeInstructions": [
    "1. Pre-heat the oven to Gas 5, 375 ̊F, 190 ̊C. Place a flat baking sheet on centre shelf to warm. Line individual tartlet tins with shortcrust pastry and chill. ",
    "2. Put the milk and water into a wide, shallow saucepan together with the sprigs of parsley roughly broken up, the bay leaf, lemon rind, a few twists of black pepper and some grated nutmeg. Heat until just beginning to bubble around the edge. Place the haddock fillet into the liquid and leave the fish to poach gently in the milk, over a low heat. This will take approximately 5–10 minutes, depending on the thickness of the fish. When it is ready, the fish will flake apart easily. Remove the cooked fish from the pan and leave to cool on a flat plate. Strain the cooking liquid through a fine sieve and set aside. ",
    "3. When it is cool, roughly flake the fish, taking care to remove any traces of skin and bones. In a clean saucepan, melt the butter until it is hot and foamy. ",
    "4. Add the chopped onion and cook until soft, but not coloured. Add the sieved plain flour and mix into the onion to make a roux. ",
    "5. Add 125ml of the milk mixture used to cook the fish, stir into the roux until it makes a thick sauce. Add the double cream and stir well. Leave to cook very gently over a low heat. ",
    "6. Meanwhile separate 2 of the eggs and reserve the whites in a clean, grease free bowl. Whisk the 2 egg yolks together with the remaining whole egg and stir into the sauce mixture. Add the flaked smoked haddock, the chopped smoked ham, the chopped spring onions and the chopped parsley. Combine all the ingredients together well. ",
    "7. Check seasoning. Remember that the haddie and the ham are both salty and so it may not be necessary to add any salt, but only a little more pepper. Remove the saucepan from the heat. ",
    "8. Whisk the egg whites until forming soft peaks. Cut and fold these into the fish mixture. Pour the mixture into the chilled tartlet cases. Sprinkle the finely grated cheddar over the top. Place the tins on a flat baking sheet and bake in a moderate oven (Gas 5, 375 ̊F, 190 ̊C) for 25–30 minutes until firm and golden. "
  ],
  "recipeCategory": null,
  "recipeCuisine": "British",
  "keywords": [
    "Seafood",
    "Smoked Haddock"
  ],
  "tool": []
}