{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Smoked Haddock Croquette with Herb Salad & Sweet Mustard Dressing",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "recipeIngredient": [
    "For the croquettes",
    "500g pale smoked haddock fillet,",
    "700ml fish stock,",
    "60g butter,",
    "60g plain flour,",
    "1 tbsp coarse grain mustard,",
    "50g grated mature cheddar cheese,",
    "1 tbsp chopped chives,",
    "Salt, pepper and nutmeg to season,",
    "500g home-made bread crumbs,",
    "200g flour (for coating),",
    "3 whisked eggs (for coating),",
    "Mixed salad leaves and fresh herbs eg. dill, chives, fennel.",
    "For the mustard dressing ",
    "2 egg yolks,",
    "4 tablespoon white wine vinegar,",
    "1 tablespoon caster sugar,",
    "1 teaspoon English mustard,",
    "2 tablespoon coarse grain mustard,",
    "200ml sunflower oil,",
    "Salt, pepper and lukewarm water."
  ],
  "recipeInstructions": [
    "1. Bring 500ml of your fish stock to boiling point, add the haddock and then remove from heat to cool down. ",
    "2. When cooled, remove haddock from fish stock then flake the haddock. ",
    "3. Top up the juices with fish stock until you have 500ml again, set aside for next stage. ",
    "4. Melt the butter in a pan, add the flour and cook for 1 minute, remove from heat and add the fish stock from the first stage. Put the pan back on a low heat and bring to the boil slowly. Simmer gently until a “thicker than sauce\" consistency has been achieved, stirring constantly. ",
    "5. Gently stir in the flaked haddock, chives, mustard and grated cheese and season to taste with salt, pepper and nutmeg. ",
    "6. Allow to cool then pipe into a continuous sausage shape of 3cm diameter on grease-proof paper, then refrigerate overnight. ",
    "7. Cut into 10cm logs and prepare a breadcrumb station. ",
    "8. Dip croquettes into the flour, then whisked egg and then finally into the breadcrumbs, ensuring they are totally covered. ",
    "9. Place in a deep fat fryer at 180°C until golden brown. (Test one first - if the croquettes are breaking repeat the egg/breadcrumb step).",
    "For the mustard dressing",
    "10. Put egg yolks in a liquidiser, add sugar, English mustard, vinegar and salt and pepper.",
    "11. Turn on the machine and pour in the oil very slowly until you have a thick emulsion.",
    "12. Add coarse grain mustard and use some lukewarm water to get the right pouring consistency."
  ],
  "recipeCategory": null,
  "recipeCuisine": "British",
  "keywords": [
    "Seafood",
    "Smoked Haddock"
  ],
  "tool": []
}