{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Grilled Haddock with Parmesan Herb Crust, Sauteed Green Vegetables service with a White Balsamic and Vine Tomato Essence and Fondant Potato",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "recipeYield": "2",
  "recipeIngredient": [
    "300g haddock,",
    "2 slices white bread,",
    "1 egg yolk,",
    "120g butter,",
    "Tarragon,",
    "Flat leaf parsley,",
    "Dill,",
    "Chervil,",
    "15g Parmesan cheese,",
    "2 baby fennel,",
    "4 broccoli florets,",
    "600ml fish stock or bullion,",
    "12 cherry tomatoes (vine on),",
    "25ml white Balsamic vinegar,",
    "1/2 shallot,",
    "1 clove of garlic,",
    "1/4 stalk of celery,",
    "1/4 carrot,",
    "1/2 sprig of thyme,",
    "7.5g brown sugar,",
    "25ml white wine,",
    "4 asparagus,",
    "1/2 courgette,",
    "1 baking potato,",
    "seasoning."
  ],
  "recipeInstructions": [
    "1. Peel the baking potato, top and tail and cut in half, place in a deep tray and pour 300ml (1/2 pint) of fish stock or to just below the top of the potato, place butter on top of the potato and place in a preheated oven at 190°C for 30 minutes. ",
    "2. Whilst the potato is cooking finely dice the onion, carrot, garlic and celery and sauté in a heavy bottom pan. Add the cherry tomatoes and sauté until soft. ",
    "3. Add white Balsamic vinegar, brown sugar and white wine. Reduce by half, then add 300ml (1/2 pint) of fish stock, reduce by half and blend, pass through a fine sieve to another pan and leave to simmer. ",
    "4. Blend bread, minus the crust, in a food blender with the herbs, egg yolk, Parmesan and butter. Spread evenly on a silicon mat and place in the fridge. ",
    "5. Prepare the vegetables into equal sizes and place in a pan of seasoned water to boil. ",
    "6. Cut fish into two equal portions and place onto a greased baking tray. ",
    "7. Once herb crust has set cut into two equal pieces to fit on top of the haddock and place in the oven at 190°C. ",
    "8. Put the the vegetables into the boiling water, take fondant potatoes out of the oven and place in the centre of a plate. ",
    "9. Once the vegetables have come back to the boil take them off the heat and strain, place them back in the pan and add butter and seasoning and arrange around the potato. ",
    "10. Spoon the sauce evenly around the plate and add the cooked haddock on top of the potato and serve. "
  ],
  "recipeCategory": null,
  "recipeCuisine": "British",
  "keywords": [
    "Seafood",
    "Smoked Haddock"
  ],
  "tool": []
}