{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Poached Haddock with Mussels, Spinach & Chervil",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "recipeYield": "4",
  "prepTime": "Preparation time:",
  "cookTime": "Cooking time:",
  "recipeIngredient": [
    "150g butter,",
    "1 shallot (finely chopped),",
    "600ml mussels,",
    "4 x 175g pieces of unskinned haddock fillet,",
    "900g fresh spinach (large stalk removed),",
    "1 tbsp malt whisky,",
    "1 tsp fresh lemon juice,",
    "1 tsp chopped chervil,",
    "Salt and freshly ground black pepper."
  ],
  "recipeInstructions": [
    "1. Heat 25g (1oz) of the butter in a medium pan, add the shallot and cook gently for 3 minutes until soft. Add the mussels and 150ml (5fl oz) of water, then cover and cook over a high heat 3–4 minutes, until the mussels have opened. ",
    "2. Tip them into a colander set over a bowl to collect the cooking liquor. When they are cool enough to handle, remove the mussels from all but 8 of the nicest shells. Cover and set aside. ",
    "3. Pour all the mussel liquor except the last tablespoon or two (which will be gritty) into a 30cm (12 inch) sauté pan, bring to a simmer and then add the haddock, skin-side up. Cover and simmer gently for 3 minutes. Remove from the heat (leaving the lid in place) and set aside for about 4 minutes to continue cooking. ",
    "4. Meanwhile, melt another 25g (1oz) of the butter in a large pan. Add the spinach and stir over a high heat until it has wilted. Cook, stirring briskly, until all the excess liquid has evaporated, then season to taste with some salt and pepper. ",
    "5. Divide the spinach between 4 warmed plates and put the haddock on top. Keep warm. Return the sauté pan to the heat, add the remaining butter and boil rapidly for 3–4 minutes, until the liquor has reduced and emulsified into a sauce. ",
    "6. Stir in the whisky and lemon juice and boil for 30 seconds. Add the chervil and mussels and stir for a few seconds, until they have heated through. Assembly Spoon the mussels around the spinach and haddock, dividing the unshelled mussels equally between the plates, then pour over the sauce and serve.Serves 4 "
  ],
  "recipeCategory": null,
  "recipeCuisine": "British",
  "keywords": [
    "Seafood",
    "Smoked Haddock"
  ],
  "tool": []
}