{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Salad Nicoise (With Anchovies)",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "recipeYield": "2",
  "prepTime": "PT30M",
  "cookTime": "PT45M",
  "recipeIngredient": [
    "2 eggs",
    "500g broad bean pods or 50g French beans",
    "4 ripe tomatoes",
    " 1/4 cucumber",
    "2 spring onions, finely chopped",
    " 1/2 red pepper, thinly sliced",
    "50g small black olives, pitted",
    "1 tbsp capers",
    "4 anchovies, cut into slivers",
    "A few basil leaves, roughly torn",
    "For the dressing:",
    "1 small clove of garlic",
    "Pinch of coarse salt",
    "2 anchovies, finely chopped",
    "Small handful of basil leaves, torn",
    "4 tbsp extra virgin olive oil",
    " 1/2 tbsp red wine vinegar",
    "Black pepper"
  ],
  "recipeInstructions": [
    "1. Put the eggs in a pan of cold water and bring slowly to the boil. Simmer for 7 1/2 minutes, then decant into a bowl of iced water. Meanwhile, pod and then peel the broad beans (if using French beans, top and tail them, then cook in salted boiling water until just tender and decant into iced water) and drop the tomatoes into boiling water for 15 seconds, then peel, slice and deseed them. Peel the cucumber in stripes, then deseed and cut into half moons.",
    "2. Make the dressing by pounding the garlic to a paste in a pestle and mortar along with a pinch of coarse salt. Add the anchovies and then the basil, and pound to a paste, adding the olive oil and the vinegar as you go. Season with black pepper.",
    "3. To put the salad together, toss the beans, tomatoes, cucumber, spring onion and red pepper together with two-thirds of the dressing and decant on to a plate. Peel and quarter the eggs and arrange on top, along with the olives, capers, anchovy strips and basil leaves. Spoon the remaining dressing over the salad and serve immediately."
  ],
  "recipeCategory": null,
  "recipeCuisine": "French",
  "keywords": [
    "Salads"
  ],
  "tool": []
}