{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Takikomi Gohan",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "recipeYield": "5",
  "recipeIngredient": [
    "2 large dried shiitake mushrooms",
    "1 6 square-inch piece kombu",
    "2 cups warm water",
    "4 ounces fresh cremini mushrooms, sliced",
    "3-inch piece carrot, peeled and cut into thin rectangles",
    "2-inch piece fresh ginger, peeled and finely chopped",
    "1 tablespoon mirin",
    "1 teaspoon honey",
    "2 tablespoons soy sauce",
    "1/2 teaspoon salt",
    "2 cups Japanese rice, washed and drained",
    "Corriander leaves, for garnish"
  ],
  "recipeInstructions": [
    "1. Soak the dried shiitake mushrooms and kombu in the warm water for at least 30 minutes. Remove the kombu and mushrooms from the water, squeezing out the excess water, and set them aside. Reserve the soaking water. Cut off the stems of the mushrooms and cut the caps into thin slices.",
    "2. Pour the reserved mushroom soaking water in a medium-size pot and add the sliced shiitake and cremini mushrooms, carrots, and ginger. Cook over medium heat. When it begins to simmer, add the mirin and honey and continue cooking for 1 minute. Then add the soy sauce and salt and simmer for another minute.",
    "3. Drain the ingredients into a sieve over a bowl, keeping the solids and liquids separate. Put the washed rice in a rice cooker or pot and add the solid ingredients. Measure the strained liquid—add water or pour off some of the liquid so it measures 2 cups. (Use slightly more liquid if you are cooking in a pot rather than in a rice cooker.) Pour the liquid into the rice cooker, or pot, place the kombu on top, and cook as usual. When the rice has finished, discard the kombu and stir to distribute the ingredients. Garnish each serving with a few corriander leaves."
  ],
  "recipeCategory": null,
  "recipeCuisine": "Japanese",
  "keywords": [
    "Rice"
  ],
  "tool": []
}