{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Slow-Roasted Lamb Shoulder with Feta Salsa",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "recipeYield": "6",
  "prepTime": "PT30M",
  "cookTime": "PT3H",
  "recipeIngredient": [
    "For the lamb",
    "120ml extra virgin olive oil,",
    "1 tsp cumin,",
    "2 garlic cloves,",
    "1 lemon,",
    "Salt and pepper,",
    "1.5 kg shoulder of lamb.",
    "For the vegetables",
    "1 courgette (diced  into 1cm cubes),",
    "1 red onion (diced  into 1cm cubes),",
    "1 red pepper (de-seeded and diced  into 1cm cubes),",
    "400g tinned chickpeas,",
    "Some extra-virgin olive oil.",
    "For the yoghurt sauce",
    "1 mini cucumber (or 1/2 cucumber),",
    "500ml Greek yogurt,",
    "3 tbsp mint (finely chopped).",
    "For the salsa",
    "120ml olive oil,",
    "2 garlic cloves,",
    "1 lemon,",
    "200g barrel-aged feta cheese.",
    "For the wraps",
    "12 tortillas or flat bread,",
    "200g mixed salad leaves,",
    "Chilli sauce or Harissa."
  ],
  "recipeInstructions": [
    "1. Take half of the olive oil and add 1 tsp of cumin, 2 cloves of crushed garlic, zest of 1 lemon and pinch of salt and pepper. Mix together then rub all over the lamb, cover in a bowl and leave to marinade overnight.",
    "2. For the salsa, in a small saucepan add the remaining olive oil, zest of 1 lemon (thinly sliced), 2 garlic cloves (sliced  as thinly as possible) and bring to a very gentle simmer. This will infuse the oil. Leave overnight.",
    "3. The next day, preheat the oven to 220°C/Gas 7. Place the lamb in an ovenproof dish and put in the oven for 35 minutes. Take out of the oven, baste, cover the tray with foil then return to the oven turning the heat down to 150°C/Gas 2. Cook for 2 1/2 hours or until the meat is falling away from the bone.",
    "4. Whilst the lamb is cooking, heat some olive oil and gently saute the vegetables until cooked and they begin to color. Add the chickpeas, season and if a little dry, a touch of virgin olive oil. Allow to cool and then gently reheat before serving.",
    "5. Remove from oven and rest for 30 minutes with the foil still on so it keeps warm.",
    "6. For the yoghurt sauce, dice  the cucumber into 1/2cm cubes and add to the yoghurt along with the chopped  mint. Season and mix thoroughly. Refrigerate until needed.",
    "7. To finish the salsa, reheat the oil and when it's gently simmering, remove from heat and crumble the feta cheese in and stir until mixed. Season and squeeze in the juice of 1 lemon. Keep warm.",
    "8. With the lamb rested, pour out all the excess out and begin to take the meat from the bone by shredding it with two forks. Pour the feta salsa over the meat and keep warm.",
    "9. To assemble the kebab take your bread and lay out on a flat surface. Take some salad and lay in the middle. Next spoon a layer of the warmed vegetables, then a layer of the lamb and salsa and finally the yogurt and chilli sauce.",
    "10. Fold over one end then roll up the kebab."
  ],
  "recipeCategory": null,
  "recipeCuisine": "Greek",
  "keywords": [
    "Meat",
    "Lamb"
  ],
  "tool": []
}