{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Saba Misoni",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "recipeYield": "2",
  "prepTime": "PT5M",
  "cookTime": "PT15M",
  "recipeIngredient": [
    "1 mackerel fillet (bines removed, halved, with a diagonal cut in the skin on each half),",
    "1 bell pepper, (seeded and quartered),",
    "white part of a long green onion (shredded),",
    "180 ml water,",
    "3 tbsp sake,",
    "1 tbsp sugar,",
    "1 tbsp mirin,",
    "1 1/2 tbsp brown miso,",
    "3 slices of ginger root,",
    "10cm green part of long green onion",
    "wooden drop-lid (otoshi buta)."
  ],
  "recipeInstructions": [
    "1. Prepare a bowl of iced water, large enough to take the fish pieces.",
    "1. Bring a pan to the boil.",
    "2. Add a ladle of cold water to the boiling (to slightly reduce the temperature), then using a mesh strainer, add the first piece of mackerel, skin side up.",
    "3. When the surface turns white, remove and plug into iced water.",
    "4. Repeat with the other piece of mackerel.",
    "5. Gently wash the fillet in the ticed water, then dry on a paper towel.",
    "6. Into a cold small frying pan add the water, sake, sugar, mirin and half of the miso (using the ladle method).",
    "7. Turn on the heat, and bring to the boil.",
    "8. Put the fish in the pan, skin side up.",
    "9. Bring the mixture to a simmer, removing any scum before adding the ginger and green part of the onion.",
    "10. Place a dampened otoshi buta onto the fish to help it cook evenly.",
    "11. Simmer for 5 minutes on medium heat.",
    "12. Uncover and remove the long green onion.",
    "13. Carefully dissolve the rest of the miso, and add the bell pepper.",
    "14. Cover with the otoshi buta and simmer for 2-3 minutes.",
    "15. Uncover, and remove the bell pepper before it’s colour fades.",
    "16. Baste the fish, and leave uncovered to reduce the sauce.",
    "17. Serve on a plate with the pepper, and some shredded green onion."
  ],
  "recipeCategory": null,
  "recipeCuisine": "Japanese",
  "keywords": [
    "Seafood",
    "Mackerel"
  ],
  "tool": []
}