{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Beef and oyster pie - Hairy Bikers",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "author": "Hairy Bikers",
  "recipeYield": "4",
  "prepTime": "PT30M",
  "cookTime": "PT2H",
  "recipeIngredient": [
    "900g/2lb stewing beef, trimmed, cut into rough 3cm/1 1/4in cubes",
    "2-3 tbsp sunflower oil",
    "3 long shallots, quartered",
    "2 garlic cloves, finely chopped",
    "125g/4 1/2oz smoked, rindless, streaky bacon rashers, cut into 1cm/ 1/2in",
    "strips",
    "1 tbsp roughly chopped thyme leaves",
    "2 bay leaves",
    "330ml/11fl oz stout",
    "400ml/14fl oz beef stock (made with one stock cube)",
    "flaked sea salt and freshly ground black pepper",
    "2 tbsp cornflour, blended with 2 tbsp water to make a smooth paste",
    "8 oysters, freshly shucked",
    "For the pastry",
    "400g/14oz plain flour, plus extra for rolling",
    " 1/4 tsp salt",
    "250g/9oz butter, frozen for at least 2 hours",
    "1 free-range egg, beaten, to glaze",
    "Preparation method",
    "1. Season the beef cubes with salt and black pepper. Heat a tablespoon of oil in the frying pan and fry the meat over a high heat. Do this in three batches so that you don’t overcrowd the pan, transferring the meat to a large flameproof casserole dish once it is browned all over. Add extra oil if the pan seems dry. ",
    "2. In the same pan, add another tablespoon of oil and cook the shallots for 4-5 minutes, then add the garlic and fry for 30 seconds. Add the bacon and fry until slightly browned. Transfer the onion and bacon mixture to the casserole dish and add the herbs.",
    "3. Preheat the oven to 180C/350F/Gas 4. ",
    "4. Pour the stout into the frying pan and bring to the boil, stirring to lift any stuck-on browned bits from the bottom of the pan. Pour the stout over the beef in the casserole dish and add the stock. Cover the casserole and place it in the oven for 1 1/2-2 hours, or until the beef is tender and the sauce is reduced. ",
    "5. Skim off any surface fat, taste and add salt and pepper if necessary, then stir in the cornflour paste. Put the casserole dish on the hob – don’t forget that it will be hot – and simmer for 1-2 minutes, stirring, until thickened. Leave to cool. Increase the oven to 200C/400F/Gas 6. To make the pastry, put the",
    "6. flour and salt in a very large bowl. Grate the butter and stir it into the flour in three batches. Gradually add 325ml/11fl oz cold water – you may not need it all – and stir with a round-bladed knife until the mixture just comes together. Knead the pastry lightly into a ball on a lightly floured surface and set aside 250g/9oz for the pie lid.",
    "7. Roll the rest of the pastry out until about 2cm/ 3/4in larger than the dish you’re using. Line the dish with the pastry then pile in the filling, tucking the oysters in as well. Brush the edge of the pastry with beaten egg. ",
    "8. Roll the remaining pastry until slightly larger than your dish and gently lift over the filling, pressing the edges firmly to seal, then trim with a sharp knife. Brush with beaten egg to glaze. Put the dish on a baking tray and bake for 25-30 minutes, or until the pastry is golden-brown and the filling is bubbling."
  ],
  "recipeInstructions": [],
  "recipeCategory": null,
  "recipeCuisine": "British",
  "keywords": [
    "Pies"
  ],
  "tool": []
}