{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Lamb Pie - Hairy Bikers",
  "author": {
    "@type": "Person",
    "name": "Rob Blackbourn"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "recipeYield": "6",
  "prepTime": "PT1H",
  "cookTime": "PT2H",
  "recipeIngredient": [
    "For the pie filling",
    "3 tbsp plain flour",
    " 1/2 tsp flaked sea salt, plus extra, to taste",
    "freshly ground black pepper, to taste",
    "1kg/2lb 2oz lamb neck fillet (preferably Gloucestershire) excess fat",
    "trimmed, cut into bite-sized pieces",
    "2-3 tbsp rapeseed oil",
    "2 onions, peeled, halved and sliced",
    " 1/2 tsp freshly grated nutmeg",
    " 1/4 tsp ground allspice",
    "1 sprig fresh rosemary, leaves only, finely chopped ",
    "500ml/17 1/2fl oz fresh chicken or lamb stock",
    "300ml/10 1/2fl oz cold water",
    "1 Bramley apple, peeled, quartered, core removed, sliced",
    "2 crisp eating apples, such as Cox, peeled, quartered, core removed, sliced",
    "4-5 large fresh sage leaves, finely sliced",
    "For the pastry ",
    "300g/10 1/2oz plain flour, plus extra for dusting",
    "good pinch salt",
    "75g/2 1/2oz cold lard, cut into small pieces",
    "75g/2 1/2oz cold butter, cut into small pieces",
    "1 free-range egg ",
    "1 tbsp cold water",
    "To serve",
    "mashed potatoes",
    "seasonal vegetables",
    "Preparation method",
    "1. For the filling, place the flour, sea salt and a good grinding of black pepper into a large bowl and mix well. Add the lamb pieces and toss well together until the meat is lightly coated with the seasoned flour.",
    "2. Heat the rapeseed oil in a large frying pan and fry the lamb pieces for 3-4 minutes, in small batches, until golden-brown all over. Transfer the seared lamb meat to a large, heavy-based pan or flame-proof casserole and set aside. ",
    "3. Return the frying pan to the heat, adding more oil if necessary, then fry the onions for 5-6 minutes, or until golden-brown. Add the onions to the casserole with the lamb. ",
    "4. Add the nutmeg, allspice and rosemary to the casserole, then pour over the stock and the water. Bring to the boil, then reduce the heat and leave to simmer for 40 minutes, or until the lamb is just tender and the liquid has reduced to a the consistency of gravy. Season, to taste, with salt and freshly ground black pepper, then remove the pan from the heat, cover and leave to cool for 30 minutes.",
    "5. Mix the apples together with the chopped sage and season with freshly ground black pepper. Set aside. ",
    "6. Meanwhile, for the pastry, sift the flour and salt into a bowl and rub in the lard and butter with your fingertips until the mixture resembles breadcrumbs. ",
    "7. Lightly whisk the egg together with the water, then place two tablespoons of the mixture into a separate bowl to use as a glaze for the pastry. ",
    "8. Make a well in the centre of the flour, lard and butter mixture and add the egg. Stir with a wooden spoon until the mixture comes together to form a dough, then shape into a ball. Lightly flour the work surface and knead the dough lightly, then flatten slightly into a round and wrap in cling film. Chill in the fridge for 30 minutes. ",
    "9. Preheat the oven to 200C/400F/Gas 6. ",
    "10. For the pie, spoon half of the lamb mixture into a 2.2 litre pie dish. Top with half the apples and cover with the remaining lamb mixture. Finish with a final layer of apples, piling them up above the edge of the dish. Ease a pie funnel into the centre of the pie to help support the pastry and set aside.",
    "11. Unwrap the pastry and roll out into a large oval shape roughly 5cm/2in larger than the pie dish. Cut a 2cm/1in wide ring of pastry from around the edge of this oval. ",
    "12. Brush the rim of the pie dish with the reserved egg and water mixture. Press the pastry ring onto the rim of the pie dish, overlapping slightly at the end join. Brush lightly with a little more egg and then cover the pie completely with the rolled pastry, making a small hole for the top of the pie funnel.",
    "13. Press the edges firmly to seal, then trim the pastry and flute all the way around. Brush the pastry with the remaining egg mixture and place the pie dish on a baking tray. Bake the pie in the centre of the oven for 25 minutes, or until the pastry is golden-brown and crisp.",
    "14. Serve the pie piping hot with creamy mashed potatoes and seasonal vegetables."
  ],
  "recipeInstructions": [],
  "recipeCategory": null,
  "recipeCuisine": "British",
  "keywords": [
    "Pies"
  ],
  "tool": []
}