{
  "@context": "http://schema.org/",
  "@type": "Recipe",
  "name": "Steak & Kidney Pudding - The Hairy Bikers",
  "author": {
    "@type": "Person",
    "name": "Hairy Bikers"
  },
  "description": "",
  "datePublished": "2019-02-15T19:59:57+00:00",
  "image": [
    "https://www.example.com/image.png"
  ],
  "recipeYield": "6",
  "prepTime": "PT30M",
  "cookTime": "PT2H",
  "recipeIngredient": [
    "3 very fresh lambs' kidneys",
    "700g/1lb 8 3/4oz well-marbled braising steak, trimmed, cut into 2.5cm/1in",
    "cubes",
    "3 tbsp plain flour",
    "salt and freshly ground black pepper",
    "4-5 tbsp sunflower oil",
    "1 medium onion, peeled, chopped",
    "200ml/7 1/4fl oz red wine",
    "4-5 sprigs fresh thyme",
    "1 fresh bay leaf",
    "500ml/18fl oz good-quality beef stock",
    "1 tbsp tomato purée",
    "For the suet pastry",
    "350g/12 1/4oz self-raising flour",
    "175g/6 1/4oz shredded suet",
    " 1/2 tsp fine sea salt",
    "butter, for greasing",
    "Preparation method",
    "1. Preheat the oven to 170ºC/350ºF/Gas 3.",
    "2. Rinse the kidneys and pat dry with kitchen paper. Cut the kidneys, in half, snip out the white cores and cut the kidneys into roughly 1.5cm/ 3/4in pieces. ",
    "3. Place the cubes of steak into a large, strong plastic bag and the kidney pieces into another bag. Divide the flour between the two bags, then season, to taste, with salt and freshly ground black pepper. Tie the ends of the bags and shake until the steak and kidneys are thoroughly coated in the seasoned flour. ",
    "4. Heat two tablespoons of the oil in a large non-stick frying pan and fry the steak, in batches, over a medium heat, adding extra oil as needed, until the steak is well-browned all over. Remove the steak from the frying pan with a slotted spoon and transfer to a flameproof casserole. ",
    "5. Return the frying pan to the heat and repeat the process with the kidneys, frying on both sides until well-browned. Remove the kidneys from the frying pan with a slotted spoon and transfer to the casserole.",
    "6. Return the frying pan to the heat, add the remaining oil, then add the onion. Cook the onion over a low heat, stirring often, for five minutes, or until softened. Stir the cooked onion into the casserole with the beef and kidneys.",
    "7. Deglaze the frying pan with the wine, bringing it to the boil while stirring to lift all the browned bits from the bottom of the pan. Pour the mixture immediately over the beef, kidneys and onion. ",
    " 8. Strip the thyme leaves from the stalks and add them to the casserole. Stir in the bay leaf, beef stock and tomato purée.  ",
    "9. Bring the beef mixture to the boil. Remove three ladlefuls of the sauce for gravy and set aside in a small pan to cool. When cooled, set it aside in the fridge for use as gravy. ",
    "10. Cover the casserole and transfer to the oven to cook for 1 1/2-2 hours, or until the beef is tender (stir the mixture halfway through cooking). ",
    "11. Return the casserole to the hob and simmer the mixture for 2-3 minutes, or until the sauce is thick enough to coat the back of a spoon. When the sauce is thick enough, remove from the heat and leave to cool. ",
    "12. Meanwhile, for the suet pastry, put the flour, suet and salt into a large bowl and mix until well combined. ",
    "13. Stir in enough water to make a soft dough - you'll probably need around 300ml/10 1/2fl oz of water. Turn out the dough onto a floured surface and bring it together to form a ball. Knead the dough lightly, then remove a generous quarter of the dough to make a lid for the pudding and set aside. Roll out the remaining pastry into a rough 5cm/10in circle (the size of an average dinner plate). It should be about 1cm/ 1/4in thick. ",
    "14. Butter a 1.5 litre/2 pint 12 3/4fl oz pudding basin and line it with the pastry. The pastry should reach 1cm/ 1/4in above the top of the dish. Prs the pastry against the sides of the basin and trim neatly. ",
    "15. Spoon the steak and kidney mixture into the pastry-lined pudding basin. Brush the rim of the pastry with water. Roll the remaining pastry into a circle just large enough to sit on top of the pudding dish and place it over the filling. Trim into place and press the edges together well to seal.",
    "16. Cover the dish with a large circle of baking parchment, with a pleat in the middle to allow for expansion. Cover the parchment with a circle of aluminium foil, again with a pleat. Secure both covers tightly with string. Create a carrying handle by tying the excess string across the top of the basin - this will help you lift the pudding out of the pan after it's cooked.",
    "17. Place the pudding onto an upturned saucer or small trivet in a large, deep saucepan and add enough just-boiled water to come halfway up the sides of the basin. Cover the pan with a tight-fitting lid and place on the hob over a medium heat. Steam the pudding in simmering water for 2 1/2 hours, adding more water as necessary.",
    "18. When the pudding is cooked through, turn off the heat and carefully lift the basin from the water. Let the pudding stand for five minutes. ",
    "19. Heat the reserved gravy on the hob, stirring, until the gravy is bubbling and heated through. Strain through a small sieve into a warmed jug. ",
    "20. Cut the string, foil and paper off the pudding basin. Run a blunt-ended knife around the inside of the pudding basin to loosen the sides of the pudding and invert it onto a deep plate. Serve in generous wedges with hot gravy."
  ],
  "recipeInstructions": [],
  "recipeCategory": null,
  "recipeCuisine": "British",
  "keywords": [
    "Pies"
  ],
  "tool": []
}